reports/output/summary_50_tps_2026-08-31_00-28-10.txt
     ✗ Status es 200 o 201
      ↳  99% — ✓ 426 / ✗ 4
     ✗ Contiene ID
      ↳  99% — ✓ 426 / ✗ 4

     checks...............................: 99.06% ✓ 852       ✗ 8   
     data_received........................: 441 kB 48 kB/s
     data_sent............................: 145 kB 16 kB/s
     http_req_blocked.....................: avg=19.06ms  min=0s       med=0s       max=252.58ms p(90)=156.84ms p(95)=159.14ms
     http_req_connecting..................: avg=9ms      min=0s       med=0s       max=81.16ms  p(90)=74.14ms  p(95)=76.29ms 
     http_req_duration....................: avg=226.27ms min=202.35ms med=214.47ms max=528.96ms p(90)=262.09ms p(95)=276.37ms
       { expected_response:true }.........: avg=226.17ms min=202.35ms med=214.47ms max=528.96ms p(90)=262.11ms p(95)=276.48ms
     ✓ { name:create_product_endpoint }...: avg=226.23ms min=202.35ms med=214.47ms max=528.96ms p(90)=262.1ms  p(95)=276.4ms 
     ✓ { name:login_endpoint }............: avg=242.68ms min=242.68ms med=242.68ms max=242.68ms p(90)=242.68ms p(95)=242.68ms
   ✓ http_req_failed......................: 0.92%  ✓ 4         ✗ 427 
     http_req_receiving...................: avg=279.51µs min=0s       med=0s       max=17.09ms  p(90)=931.2µs  p(95)=1.23ms  
     http_req_sending.....................: avg=486.85µs min=0s       med=361.1µs  max=25.83ms  p(90)=998.9µs  p(95)=1.02ms  
     http_req_tls_handshaking.............: avg=10.04ms  min=0s       med=0s       max=178.03ms p(90)=81.07ms  p(95)=82.91ms 
     http_req_waiting.....................: avg=225.51ms min=200.83ms med=214.16ms max=528.96ms p(90)=261.85ms p(95)=275.39ms
     http_reqs............................: 431    46.518315/s
     iteration_duration...................: avg=245.23ms min=202.35ms med=217.16ms max=528.96ms p(90)=365.75ms p(95)=373.56ms
     iterations...........................: 430    46.410384/s
     vus..................................: 11     min=10      max=18
     vus_max..............................: 50     min=50      max=50